SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


replace INTO `{db_prefix}permissions` (`id`, `fid`, `icon`, `name`, `display_name`, `description`, `is_menu`, `sort`, `created_at`, `updated_at`) VALUES
(20, 0, 'edit', '#-1456129983', '系统设置', '', 1, 100, '2016-02-22 08:33:03', '2016-02-22 08:33:03'),
(21, 20, '', 'admin.admin_user.index', '用户权限', '查看后台用户列表', 1, 0, '2016-02-18 07:56:26', '2016-02-18 07:56:26'),
(22, 20, '', 'admin.admin_user.create', '创建后台用户', '页面', 0, 0, '2016-02-23 03:48:18', '2016-02-23 03:48:18'),
(35, 0, 'home', 'admin.home', 'Dashboard', '后台首页', 1, 0, '2016-02-22 08:32:40', '2016-02-22 08:32:40'),
(38, 20, '', 'admin.admin_user.store', '保存新建后台用户', '操作', 0, 0, '2016-02-23 03:48:52', '2016-02-23 03:48:52'),
(39, 20, '', 'admin.admin_user.destroy', '删除后台用户', '操作', 0, 0, '2016-02-23 03:49:09', '2016-02-23 03:49:09'),
(40, 20, '', 'admin.admin_user.destory.all', '批量后台用户删除', '操作', 0, 0, '2016-02-23 04:01:01', '2016-02-23 04:01:01'),
(42, 20, '', 'admin.admin_user.edit', '编辑后台用户', '页面', 0, 0, '2016-02-23 03:48:35', '2016-02-23 03:48:35'),
(43, 20, '', 'admin.admin_user.update', '保存编辑后台用户', '操作', 0, 0, '2016-02-23 03:50:12', '2016-02-23 03:50:12'),
(44, 20, '', 'admin.permission.index', '权限管理', '页面', 0, 0, '2016-02-23 03:51:36', '2016-02-23 03:51:36'),
(45, 20, '', 'admin.permission.create', '新建权限', '页面', 0, 0, '2016-02-23 03:52:16', '2016-02-23 03:52:16'),
(46, 20, '', 'admin.permission.store', '保存新建权限', '操作', 0, 0, '2016-02-23 03:52:38', '2016-02-23 03:52:38'),
(47, 20, '', 'admin.permission.edit', '编辑权限', '页面', 0, 0, '2016-02-23 03:53:29', '2016-02-23 03:53:29'),
(48, 20, '', 'admin.permission.update', '保存编辑权限', '操作', 0, 0, '2016-02-23 03:53:56', '2016-02-23 03:53:56'),
(49, 20, '', 'admin.permission.destroy', '删除权限', '操作', 0, 0, '2016-02-23 03:54:27', '2016-02-23 03:54:27'),
(50, 20, '', 'admin.permission.destory.all', '批量删除权限', '操作', 0, 0, '2016-02-23 03:55:17', '2016-02-23 03:55:17'),
(51, 20, '', 'admin.role.index', '角色管理', '页面', 0, 0, '2016-02-23 03:56:07', '2016-02-23 03:56:07'),
(52, 20, '', 'admin.role.create', '新建角色', '页面', 0, 0, '2016-02-23 03:56:33', '2016-02-23 03:56:33'),
(53, 20, '', 'admin.role.store', '保存新建角色', '操作', 0, 0, '2016-02-23 03:57:26', '2016-02-23 03:57:26'),
(54, 20, '', 'admin.role.edit', '编辑角色', '页面', 0, 0, '2016-02-23 03:58:25', '2016-02-23 03:58:25'),
(55, 20, '', 'admin.role.update', '保存编辑角色', '操作', 0, 0, '2016-02-23 03:58:50', '2016-02-23 03:58:50'),
(56, 20, '', 'admin.role.permissions', '角色权限设置', '', 0, 0, '2016-02-23 03:59:26', '2016-02-23 03:59:26'),
(57, 20, '', 'admin.role.destroy', '角色删除', '操作', 0, 0, '2016-02-23 03:59:49', '2016-02-23 03:59:49'),
(58, 20, '', 'admin.role.destory.all', '批量删除角色', '', 0, 0, '2016-02-23 04:01:58', '2016-02-23 04:01:58'),
(59, 0, 'user', '#-1492598538', '借款人管理', '', 1, 2, '2017-04-19 10:35:13', '2017-04-19 10:42:18'),
(60, 59, '', 'admin.user.balanceChange', '充值扣款', '', 1, 0, '2017-04-19 10:43:40', '2017-04-19 10:43:40'),
(61, 59, '', 'admin.user.doBalanceChange', '执行充值扣款', '', 0, 0, '2017-04-19 11:38:34', '2017-04-19 11:38:57'),
(0, 59, '', 'admin.user.userList', '用户列表', '', 1, 0, '2017-04-19 11:38:34', '2017-04-19 11:38:57'),
(63, 59, '', 'admin.user.fundHistory', '资金流水', '', 1, 0, '2017-04-24 11:17:54', '2017-04-24 11:17:54'),
(64, 0, 'list', '#-1493025830', '债权管理', '', 1, 0, '2017-04-24 09:23:50', '2017-04-24 09:23:50'),
(65, 64, '', 'admin.credit.list', '债权列表', '', 1, 0, '2017-04-24 09:24:13', '2017-04-24 09:24:13'),
(66, 64, '', 'admin.credit.refunding.export', '满标放款债权导出', '', 0, 0, '2017-04-26 05:16:51', '2017-04-26 05:16:58');

--
-- 转存表中的数据 `admin_users`
--

replace INTO `{db_prefix}admin_users` (`id`, `name`, `email`, `password`, `is_super`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'admin', 'admin@admin.com', '$2y$10$GBKiY/ngDVpe1iHwlTem3e0fbNrnv1sRLGcj4wT1isK0gbzY4oQoC', 1, 'aot2y8pFRyurjUWQs2JiH3QWZJcSTepfsgB1qXPwtXST8inqnjdTwilMSaa4', '2016-02-23 02:44:26', '2016-02-23 02:44:26');

-- --------------------------------------------------------
